In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("sales_data.csv")
print(df.to_string())

   OrderID CustomerName        City     Product     Category  Quantity  Price  Discount
0     1001        Anish   Kathmandu      Laptop  Electronics         1  80000      10.0
1     1002         Riya     Pokhara       Phone  Electronics         2  30000       5.0
2     1003        Suman   Kathmandu  Headphones  Electronics         1   2000       NaN
3     1004        Anish   Kathmandu      Laptop  Electronics         1  80000      10.0
4     1005        Kiran  Biratnagar       Chair    Furniture         3   5000       0.0
5     1006          NaN     Pokhara       Table    Furniture         1  15000       5.0
6     1007        Meena    Lalitpur       Phone  Electronics         1  30000      50.0
7     1008       Ramesh   Kathmandu        Book   Stationery         5    500      -5.0
8     1009         Sita     Pokhara         Pen   Stationery        10     50       0.0
9     1010        Suman   Kathmandu      Laptop  Electronics         1  80000     110.0

In [11]:
df_backup = df.copy()
df_backup.to_csv("sales_data.csv", index=False)

In [12]:
df.columns

Index(['OrderID', 'CustomerName', 'City', 'Product', 'Category', 'Quantity',
       'Price', 'Discount'],
      dtype='object')

In [13]:
df.shape

(10, 8)

In [ ]:
df["TotalAmount"] = df["Quantity"] * df["Price"]  #Totalamount vanni euta coloumn banayo "varaible" tesma each quantity ko price seta multiply gareko to know the TA ko each

In [15]:
df.head()

,OrderID,CustomerName,City,Product,Category,Quantity,Price,Discount,TotalAmount
0,1001,Anish,Kathmandu,Laptop,Electronics,1,80000,10.0,80000
1,1002,Riya,Pokhara,Phone,Electronics,2,30000,5.0,60000
2,1003,Suman,Kathmandu,Headphones,Electronics,1,2000,NaN,2000
3,1004,Anish,Kathmandu,Laptop,Electronics,1,80000,10.0,80000
4,1005,Kiran,Biratnagar,Chair,Furniture,3,5000,0.0,15000

In [ ]:
df["TotalAmount"].sum() #TotalAmount ko sum

np.int64(365000)

In [ ]:
df["TotalAmount"].mean() #TotalAmount ko mean nikalney bela .mean()

np.float64(36500.0)

In [ ]:
df[df["TotalAmount"] > 30000] #Order above 30k . This returns ROWS, not True/False.

,OrderID,CustomerName,City,Product,Category,Quantity,Price,Discount,TotalAmount
0,1001,Anish,Kathmandu,Laptop,Electronics,1,80000,10.0,80000
1,1002,Riya,Pokhara,Phone,Electronics,2,30000,5.0,60000
3,1004,Anish,Kathmandu,Laptop,Electronics,1,80000,10.0,80000
9,1010,Suman,Kathmandu,Laptop,Electronics,1,80000,110.0,80000

**groupby() means "Split->Calculate->Combine"**

In [ ]:
#Grouping (CORE ANALYST SKILl)
df.groupby("City")["TotalAmount"].sum() #City ma kati ko Total sales hunxa vanera we use groupby / () call or do something
                                        #() for the work to do " run action " / [] to pick the data from coloumn "select data"

City
Biratnagar     15000
Kathmandu     244500
Lalitpur       30000
Pokhara        75500
Name: TotalAmount, dtype: int64

In [ ]:
df.groupby("Category")["TotalAmount"].sum() #kun Category ko product total sales bhayo vanera

Category
Electronics    332000
Furniture       30000
Stationery       3000
Name: TotalAmount, dtype: int64

In [ ]:
df.groupby("City")["TotalAmount"].sum().sort_values(ascending=False) #this shows which city sells the most item by totalamount sales

City
Kathmandu     244500
Pokhara        75500
Lalitpur       30000
Biratnagar     15000
Name: TotalAmount, dtype: int64

In [26]:
print(df.to_string())

   OrderID CustomerName        City     Product     Category  Quantity  Price  Discount  TotalAmount
0     1001        Anish   Kathmandu      Laptop  Electronics         1  80000      10.0        80000
1     1002         Riya     Pokhara       Phone  Electronics         2  30000       5.0        60000
2     1003        Suman   Kathmandu  Headphones  Electronics         1   2000       NaN         2000
3     1004        Anish   Kathmandu      Laptop  Electronics         1  80000      10.0        80000
4     1005        Kiran  Biratnagar       Chair    Furniture         3   5000       0.0        15000
5     1006          NaN     Pokhara       Table    Furniture         1  15000       5.0        15000
6     1007        Meena    Lalitpur       Phone  Electronics         1  30000      50.0        30000
7     1008       Ramesh   Kathmandu        Book   Stationery         5    500      -5.0         2500
8     1009         Sita     Pokhara         Pen   Stationery        10     50       0.0          500
9     1010        Suman   Kathmandu      Laptop  Electronics         1  80000     110.0        80000

In [28]:
df.groupby("Product")["TotalAmount"].sum().sort_values(ascending=True) #sort_value arrange the reslults in order based on values from smallest to largest (ascending=True)small to big (ascending=false)big to small
#This tells you which product earns the most money.

Product
Pen              500
Headphones      2000
Book            2500
Chair          15000
Table          15000
Phone          90000
Laptop        240000
Name: TotalAmount, dtype: int64

In [ ]:
df.groupby(["City","Category"])["TotalAmount"].sum()

City        Category
Biratnagar  Furniture      15000.0
Kathmandu   Electronics    60500.0
            Stationery      2500.0
Lalitpur    Electronics    30000.0
Pokhara     Electronics    60000.0
            Furniture      15000.0
            Stationery       500.0
Name: TotalAmount, dtype: float64